; domain
(define
  (domain BLOCKS)
  (:requirements :strips :typing :equality)
  (:types block)
  (:constants S T A R H C U K - block)
  (:predicates (on ?x ?y - block) (ontable ?x - block) (clear ?x - block) (handempty) (holding ?x - block) (obs_0) (obs_1))
  (:action pick-up :parameters (?x - block) :precondition (and (clear ?x) (ontable ?x) (handempty)) :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x)))
  (:action put-down :parameters (?x - block) :precondition (holding ?x) :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x)))
  (:action stack :parameters (?x ?y - block) :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y))) :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y)))
  (:action unstack :parameters (?x ?y - block) :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y))) :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y))))
  (:action unstack__obs1 :parameters () :precondition (and (on s a) (clear s) (handempty) (not (= s a)) (obs_0)) :effect (and (holding s) (clear a) (not (clear s)) (not (handempty)) (not (on s a)) (obs_1)))
)

; problem
(define (problem blocks_words)
(:domain blocks)
(:objects

M O T H E R W A - block
)
(:init
(HANDEMPTY)
(CLEAR M)
(ON M O)
(ONTABLE O)
(CLEAR E)
(ONTABLE E)
(CLEAR T)
(ON T W)
(ONTABLE W)
(CLEAR H)
(ONTABLE H)
(CLEAR R)
(ON R A)
(ONTABLE A)
)
(:goal (and
(CLEAR T)
(ONTABLE W)
(ON T H)
(ON H A)
(ON A W)
))
)

; plan
1. (unstack r a)
   deleted: (clear r) (handempty) (on r a)
   added: (holding r) (clear a)
   goals met: 2 of 5
2. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 2 of 5
3. (unstack t w)
   deleted: (clear t) (handempty) (on t w)
   added: (holding t) (clear w)
   goals met: 1 of 5
4. (stack t e)
   deleted: (holding t) (clear e)
   added: (clear t) (handempty) (on t e)
   goals met: 2 of 5
5. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 2 of 5
6. (stack a w)
   deleted: (holding a) (clear w)
   added: (clear a) (handempty) (on a w)
   goals met: 3 of 5
7. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 3 of 5
8. (stack h a)
   deleted: (holding h) (clear a)
   added: (clear h) (handempty) (on h a)
   goals met: 4 of 5
9. (unstack t e)
   deleted: (clear t) (handempty) (on t e)
   added: (holding t) (clear e)
   goals met: 3 of 5
10. (stack t h)
   deleted: (holding t) (clear h)
   added: (clear t) (handempty) (on t h)
   goals met: 5 of 5
